app/views/comments/index.html.erb

SELECT "comments".* FROM "comments"
---
		<%= render 'parent_post_partial', post: @comment_struct.post %><br>
		<% if @comment_struct.comments.present? %>