app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test with user session"], ["post_id", 2], ["author", 1], ["created_at", "2017-03-22 18:32:03.276305"], ["updated_at", "2017-03-22 18:32:03.276305"]]
---
	def create
		@comment_struct.comment = @comment_struct.post.comments.new(params_values)
		@comment_struct.comment.author = current_user.id
		if @comment_struct.comment.save

UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "Create Comments 1.1"], ["updated_at", "2017-03-22 21:35:42.406101"], ["id", 5]]
---
	def update
		@comment_struct.comment.assign_attributes(params_values)
		if @comment_struct.comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
---
	def destroy
		@comment_struct.comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 6]]
---
		def set_id
			@comment_struct.comment = Comment.find_by_id(params[:id])