app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_by", "updated_by", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Creating New Comments"], ["body", "New Comments"], ["created_by", 1], ["updated_by", 1], ["created_at", "2017-03-22 21:34:07.185577"], ["updated_at", "2017-03-22 21:34:07.185577"]]
---
	def create
		@post = Post.new(params_values)
		@post.created_by = current_user.id

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Updating New Comments"], ["updated_at", "2017-03-22 21:34:17.168162"], ["id", 4]]
---
	def update
		@post.assign_attributes(params_values)
		@post.updated_by = current_user.id

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
---
		def set_id
			@post = Post.find_by_id(params[:id])